Tekla.Structures.DialogInternal.CoreInpDialogInterface.AttributeRequestedEvent
The attribute requested event

Tekla.Structures.DialogInternal.CoreInpDialogInterface.AttributeRequestedCallback(System.IntPtr,System.String,System.String,System.Double,System.Int32)
Callback function to be called from native INP dialog
handle: Native dialog handle
size: Rebar size
grade: Rebar grade
radius: Rebar radius
usage: Rebar usage
Returns: 1, always